Revit 2026 API

# IFCLinkOrientation Enumeration

---

IFC Link Orientation within the Host Document.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCLinkOrientation
```
```vb
Public Enumeration IFCLinkOrientation
```
```cpp
public enum class IFCLinkOrientation
```
```fsharp
type IFCLinkOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| ProjectNorth | 0 | Orient IFC File to Project North. |
| TrueNorth | 1 | Orient IFC File to True North. |

#### Reference

Autodesk.Revit.DB.IFC Namespace